[
    {
        "activity": "Crea un programa que use un ciclo while para mostrar una cuenta regresiva desde 20 hasta 1, mostrando cada número en la consola. Al final debe mostrar '¡Despegue!'.",
        "solution": "ejercicios-while/ejercicio_while_01.js"
    },
    {
        "activity": "Utiliza un ciclo while para calcular la suma de todos los números pares entre 1 y 50. Muestra el resultado final y cuántos números pares se sumaron.",
        "solution": "ejercicios-while/ejercicio_while_02.js"
    },
    {
        "activity": "Implementa un sistema que use un ciclo while para solicitar una contraseña al usuario hasta que ingrese 'admin123'. Debe mostrar cuántos intentos fallidos hubo antes del acceso correcto.",
        "solution": "ejercicios-while/ejercicio_while_03.js"
    },
    {
        "activity": "Crea un programa que use un ciclo while para generar números aleatorios entre 1 y 100 hasta que salga un número mayor a 95. Muestra cada número generado y al final indica cuántos números se generaron.",
        "solution": "ejercicios-while/ejercicio_while_04.js"
    },
    {
        "activity": "Desarrolla una función que use un ciclo while para calcular el factorial de un número dado. Debe mostrar paso a paso cómo se va calculando el factorial.",
        "solution": "ejercicios-while/ejercicio_while_05.js"
    },
    {
        "activity": "Dado un array de nombres, usa un ciclo while para buscar un nombre específico. El programa debe mostrar en qué posición se encontró el nombre o indicar si no existe.",
        "solution": "ejercicios-while/ejercicio_while_06.js"
    },
    {
        "activity": "Implementa un programa que use un ciclo while para contar cuántos dígitos tiene un número entero positivo. Por ejemplo, 12345 tiene 5 dígitos.",
        "solution": "ejercicios-while/ejercicio_while_07.js"
    },
    {
        "activity": "Utiliza un ciclo while para generar los primeros 15 números de la secuencia de Fibonacci. Muestra cada número de la secuencia.",
        "solution": "ejercicios-while/ejercicio_while_08.js"
    },
    {
        "activity": "Crea un juego que use un ciclo while donde el usuario debe adivinar un número entre 1 y 50. Proporciona pistas ('muy alto', 'muy bajo', 'cerca') y limita a 7 intentos máximo.",
        "solution": "ejercicios-while/ejercicio_while_09.js"
    },
    {
        "activity": "Desarrolla un programa que use un ciclo while para procesar calificaciones de estudiantes. Debe continuar pidiendo calificaciones hasta que se ingrese -1, luego calcular y mostrar el promedio, la calificación más alta y más baja.",
        "solution": "ejercicios-while/ejercicio_while_10.js"
    },
    {
        "activity": "Usa un ciclo for anidado para crear las tablas de multiplicar del 1 al 10. Cada tabla debe mostrarse claramente separada y formateada.",
        "solution": "ejercicios-for/ejercicio_for_01.js"
    },
    {
        "activity": "Implementa un programa que use ciclos for anidados para crear un patrón de asteriscos en forma de diamante: *, **, ***, ****, *****, ****, ***, **, *",
        "solution": "ejercicios-for/ejercicio_for_02.js"
    },
    {
        "activity": "Dado un array de 20 números aleatorios, usa un ciclo for para encontrar: el número mayor, el menor, la suma total, el promedio, y cuántos números son pares e impares.",
        "solution": "ejercicios-for/ejercicio_for_03.js"
    },
    {
        "activity": "Utiliza ciclos for anidados para encontrar y mostrar todos los números primos entre 1 y 100. Debe indicar cuántos números primos se encontraron.",
        "solution": "ejercicios-for/ejercicio_for_04.js"
    },
    {
        "activity": "Crea un programa que use un ciclo for para invertir una cadena de texto carácter por carácter. Muestra tanto la cadena original como la invertida.",
        "solution": "ejercicios-for/ejercicio_for_05.js"
    },
    {
        "activity": "Implementa una función que use un ciclo for para calcular la potencia de un número sin usar Math.pow(). Debe mostrar el proceso paso a paso.",
        "solution": "ejercicios-for/ejercicio_for_06.js"
    },
    {
        "activity": "Usa ciclos for anidados para crear una matriz 5x5 donde cada elemento sea la suma de sus índices (fila + columna). Muestra la matriz formateada.",
        "solution": "ejercicios-for/ejercicio_for_07.js"
    },
    {
        "activity": "Desarrolla un programa que use un ciclo for para contar cuántas vocales (a, e, i, o, u) hay en una frase dada. Debe mostrar el conteo de cada vocal por separado.",
        "solution": "ejercicios-for/ejercicio_for_08.js"
    },
    {
        "activity": "Utiliza un ciclo for para generar la siguiente secuencia: 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024. Debe mostrar cada término y la suma total de la secuencia.",
        "solution": "ejercicios-for/ejercicio_for_09.js"
    },
    {
        "activity": "Implementa un programa que use un ciclo for para verificar si una palabra o frase es un palíndromo (se lee igual de izquierda a derecha que de derecha a izquierda). Ignora espacios y mayúsculas.",
        "solution": "ejercicios-for/ejercicio_for_10.js"
    }
]